hotelReservation/results/client_load_sweeps/20260331T203937Z_hotels/logs/wrk_hotels_7000.log
Running 2m test @ http://c220g1-030826.wisc.cloudlab.us:5000
  4 threads and 128 connections

  Thread calibration: mean lat.: 2.894ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.909ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.974ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.929ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://c220g1-030826.wisc.cloudlab.us:5000 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.98ms    1.23ms   7.21ms   81.36%
    Req/Sec     1.85k   469.51     3.00k    68.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.69ms
 75.000%    3.44ms
 90.000%    4.42ms
 99.000%    7.21ms
 99.900%   10.90ms
 99.990%   25.14ms
 99.999%   33.89ms
100.000%   37.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.187     0.000000            1         1.00
       1.838     0.100000        77102         1.11
       2.057     0.200000       153941         1.25
       2.259     0.300000       231587         1.43
       2.469     0.400000       308509         1.67
       2.695     0.500000       384850         2.00
       2.817     0.550000       423501         2.22
       2.949     0.600000       462012         2.50
       3.091     0.650000       500416         2.86
       3.253     0.700000       539171         3.33
       3.439     0.750000       577324         4.00
       3.549     0.775000       596674         4.44
       3.673     0.800000       615901         5.00
       3.813     0.825000       635135         5.71
       3.979     0.850000       654320         6.67
       4.175     0.875000       673570         8.00
       4.291     0.887500       683182         8.89
       4.423     0.900000       692743        10.00
       4.579     0.912500       702537        11.43
       4.755     0.925000       711996        13.33
       4.971     0.937500       721690        16.00
       5.099     0.943750       726514        17.78
       5.243     0.950000       731278        20.00
       5.403     0.956250       736105        22.86
       5.591     0.962500       740891        26.67
       5.811     0.968750       745704        32.00
       5.935     0.971875       748058        35.56
       6.079     0.975000       750509        40.00
       6.239     0.978125       752909        45.71
       6.431     0.981250       755277        53.33
       6.655     0.984375       757699        64.00
       6.779     0.985938       758883        71.11
       6.927     0.987500       760107        80.00
       7.091     0.989062       761290        91.43
       7.291     0.990625       762500       106.67
       7.503     0.992188       763698       128.00
       7.643     0.992969       764293       142.22
       7.795     0.993750       764890       160.00
       7.983     0.994531       765495       182.86
       8.187     0.995313       766098       213.33
       8.447     0.996094       766703       256.00
       8.599     0.996484       766995       284.44
       8.783     0.996875       767296       320.00
       8.983     0.997266       767600       365.71
       9.271     0.997656       767899       426.67
       9.567     0.998047       768197       512.00
       9.751     0.998242       768354       568.89
       9.943     0.998437       768505       640.00
      10.175     0.998633       768648       731.43
      10.495     0.998828       768802       853.33
      10.951     0.999023       768950      1024.00
      11.255     0.999121       769024      1137.78
      11.487     0.999219       769102      1280.00
      11.903     0.999316       769174      1462.86
      12.471     0.999414       769250      1706.67
      13.191     0.999512       769325      2048.00
      13.559     0.999561       769362      2275.56
      14.255     0.999609       769400      2560.00
      14.991     0.999658       769437      2925.71
      16.319     0.999707       769475      3413.33
      17.839     0.999756       769513      4096.00
      18.239     0.999780       769531      4551.11
      18.863     0.999805       769550      5120.00
      19.631     0.999829       769569      5851.43
      21.199     0.999854       769588      6826.67
      22.719     0.999878       769607      8192.00
      24.671     0.999890       769616      9102.22
      25.263     0.999902       769625     10240.00
      26.335     0.999915       769635     11702.86
      27.503     0.999927       769645     13653.33
      28.047     0.999939       769654     16384.00
      28.271     0.999945       769658     18204.44
      28.943     0.999951       769663     20480.00
      29.711     0.999957       769668     23405.71
      30.239     0.999963       769672     27306.67
      30.495     0.999969       769677     32768.00
      30.991     0.999973       769679     36408.89
      31.871     0.999976       769682     40960.00
      32.047     0.999979       769684     46811.43
      32.559     0.999982       769687     54613.33
      33.023     0.999985       769689     65536.00
      33.247     0.999986       769690     72817.78
      33.407     0.999988       769691     81920.00
      33.887     0.999989       769692     93622.86
      34.175     0.999991       769693    109226.67
      35.679     0.999992       769695    131072.00
      35.679     0.999993       769695    145635.56
      35.743     0.999994       769696    163840.00
      35.743     0.999995       769696    187245.71
      36.287     0.999995       769697    218453.33
      36.671     0.999996       769698    262144.00
      36.671     0.999997       769698    291271.11
      36.671     0.999997       769698    327680.00
      36.671     0.999997       769698    374491.43
      37.535     0.999998       769699    436906.67
      37.535     0.999998       769699    524288.00
      37.535     0.999998       769699    582542.22
      37.535     0.999998       769699    655360.00
      37.535     0.999999       769699    748982.86
      37.951     0.999999       769700    873813.33
      37.951     1.000000       769700          inf
#[Mean    =        2.976, StdDeviation   =        1.231]
#[Max     =       37.920, Total count    =       769700]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  838057 requests in 2.00m, 211.43MB read
Requests/sec:   6983.87  
Transfer/sec:      1.76MB